{
    "blogs": [{"id": 0,
        "title": "Writing",
        "url": "writing",
        "label": "writers journal 1",
        "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/British_Museum_Flood_Tablet.jpg/800px-British_Museum_Flood_Tablet.jpg",
        "date": "December 1, 2021",
    "content": "&nbsp;&nbsp;&nbsp;&nbsp; Throughout my years as a student I have written many papers so this is a cherished topic. Writing can take on different styles but in essence I like to think of it as the communication of ideas through text. Early on in my life I learned the basics of writing along with reading while in school. Even at that early age we practiced similar habits of mind including creativity, flexibility and metacognition. <br /> &nbsp;&nbsp;&nbsp;&nbsp; History teaches us that writing was developed as a way to track transactions. We often write journals or blogs about what is happening in our daily life. However that may not be what’s most admired by us, we are more likely to enjoy a good story. Such as the Epic of Gilgamesh, one of the first the earliest written texts. Fictional tales like this are amazing for developing the creativity of writers which is one of the reasons it is still known of today. When writing either factual accounts or completely fictional it is the communication of ideas that intrigues us the most.  <br /> &nbsp;&nbsp;&nbsp;&nbsp; The process of learning to write starts at a young age. As kids when we start school we are introduced to the alphabet so we can start reading and writing small words. While progressing through school we read and write much more. Some of my favorite authors to read are J.K.Rowling, James Patterson and Scott Galloway. Although these authors write about different topics or within different genres they have the ability to communicate ideas that are entertaining to the reader. This has taught me the importance of analogies and metaphors. These literary concepts keep readers engaged like they are watching a martial arts master practicing his craft. Just like any craft must continue practicing writing to learn how to connect with different audiences or as described in this course rhetorical knowledge.  <br /> &nbsp;&nbsp;&nbsp;&nbsp; My understanding of writing also includes the important habits of mind. Creativity within writing is very interesting. It allows the reader the opportunity to think about your ideas in a way that they have not heard before. Along with that flexibility allows us to write on a broad range of topics. This ranges from serious writing such as a sermon or biography to more creative and playful writing like romance novels and comic books. It will be important to be mindful of staying flexible as writers as we develop our rhetorical knowledge. As we develop our skills as writers metacognition becomes ever more important, the ability to think about what we have written in the past and improve upon those ideas for even greater clarity to the reader.  <br /> &nbsp;&nbsp;&nbsp;&nbsp; As expressed writing is a craft that you can practice but it will take a long time to master it. Even when you feel masterful there are more audiences to write for and styles of writing you can practice. My understanding of writing is that you can always continue to grow. Throughout this course we will continue to practice habits of mind so that we too can become better writers."
},
    {"id": 1,
    "title": "Writing Journal #2",
    "url": "wj2",
    "img": "https://images.pexels.com/photos/57690/pexels-photo-57690.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
    "date": "Feburary 10, 2022",
"content": "   <p>In this journal I will discuss my first impressions of the Literacy Narrative. Planning our first major writing assignment feels like a big undertaking. This could be due to the lack of writing I have been doing. I know that writing consistently is the key to success in a course like this. However, since I stopped blogging I haven't had the motivation to work on my writing skills. When I do find the time to write it is much more convenient to write about my hobbies and interests. Therefore Literacy Narrative will be a lot more strict than my own personal creative writing.</p> <p>My first impressions of the writing narratives are that you can write about anything you've written in the past. That's very vague and there's endless possibilities since I have written a lot. I'm concerned that the vagueness will add to the complexity when trying to stay on topic. With  such a high word length it will be difficult not to ramble on about pointless topics. There will also be the need to make sure all topics are organized and flow consistently. I'm excited to share my experience with creative writing. Whether it be essays, term papers, book reports, or simple blog posts. I have written all of these things and they have helped shape me as a writer. </p> <p>Critical thinking and composing are the most important communication literacies in my life at the moment. Although we do live in a social media world I find myself writing more for professional purposes more often than personal. Ironically this is mostly chatting with my team members on slack or developing my professional network on LinkedIn. Slack and other team communication software has gotten even more important since the covid pandemic has started. The team I work with is full of remote workers and we need to be able to communicate to get our work done. Due to the nature of this type of communication it can be harder to communicate successfully this is why critical thinking and composing are so important. We need to ensure that work gets done efficiently while being as concise as possible. </p> <p>It may have helped if we had some type of formal training on communication in these platforms but there is no standard. Unfortunately while working independently through covid a lot of us found ourselves picking up new skills and moving into new fields. This is great for personal growth especially since we have to learn so much on our own.  For me I was just told “we’re using Slack to communicate”, it was just expected of me to know how to use it. I’m assuming it was the same for the rest of the team. I wish there was more formal communication training so everyone knew about how to transfer files or even better using GIt. Files become a huge mess especially when multiple people are working on the same file that becomes over a thousand lines long!</p> <p>I’m looking forward to writing the narrative assignment. It will be a great opportunity to share my experience with communication literacies. Until then I will be using my reading skills with Race after technology by Ruha benjamin. </p>"
   },
    {"id": 2,
        "title": "Writing Journal #3",
        "url": "wj3",
        "img": "https://images.pexels.com/photos/1194197/pexels-photo-1194197.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260",
        "date": "Feburary 12, 2022",
        "content": "<p>Taking a walk down memory lane. In this journal we will look back at the past journals we have written. I am a firm believer that reflecting on the past can help you grow as a person. You may be able to identify errors in your own decision making that will help you make better decisions in the future. This applies perfectly to writing because we can look at our past work and improve upon what we have written so far. </p> <p>At this point in the course we have written two journals so far. My initial approach to the assignments has been to read over the requirements listed in the tasks section and write at least one detailed paragraph for each point. These assignments have shaped my writing by allowing me to practice the habits of mind. I feel a sense of enhanced metacognition now that I have been writing more. Now when I sit down to write I no longer feel the anxiousness over the word count or even the confusion that comes with trying to write the next sentence. There’s a more peaceful flow that helps me get the assignments done. </p> <p>Being able to process my thoughts in a much more organized way will help me not only in this course but in life as well. I believe the openness and responsibility gives me the desire to become a better human being overall. The best thing about these assignments in my opinion is that they have structure. Just as in life there is a criteria of what needs to be accomplished and it’s up to us to figure out the best way to tackle these problems. As a computer scientist this is a significant skill since the main requirement of the job is problem solving. In this field we mostly focus on math, however I believe writing is just as powerful. In math we are given a problem and expected to solve it by finding a specific answer. Writing similarly to life, is not like that. We have a lot more freedom to express ourselves creatively, no two lives are the same just as with writing assignments.</p> <p>A big concern of mine is interpersonal communication, I believe that being a great writer will also make you a better communicator. The way that writing makes us structure our words and thoughts is an absolute benefit to us. Structure gives us the ability to clearly explain our points in a way that the person we are communicating with will understand. For instance someone that lacks the structure we develop by writing may have great ideas but people will not be able to digest them if they leave people confused when they express themselves. When we structure our thoughts we have a better understanding of what our audience needs to understand before we move on to more complex ideas. </p>        <p>These writings have been a great experience. My mind is being developed so that i can not only solve more complex problems but explain these concepts to others and hopefully bring them to the same level of understanding. I see this as much more than just a course for credit but a life skill that will continue to pay dividends. </p>"
     },
        {"id": 3,
            "title": "Writing Journal #4",
            "url": "wj4",
            "img": "https://images.pexels.com/photos/4262007/pexels-photo-4262007.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500",
            "date": "Feburary 14, 2022",
            "content": "<p>Miscommunication can derail your plans, in this writing journal we will reflect on a situation where the wrong use of words caused unintended results. We will also explore how word choice can affect others. When we are communicating in this digital age we still have to be sure to be clear with what we are saying. Sending quick texts to family and friends is fun, however  we must still put effort into them to ensure we have communicated our thoughts clearly.</p><p>It’s thanksgiving day, in my family it’s tradition to eat at my mom’s house. My sister and I often communicate through text. This time we were talking about the dinner menu to make sure we all had our favorite food. I was picking up a few drinks at the store when she sent me a text saying, Do you want pie for dessert? Excitedly, I responded Yes! After all, who could resist pie on Thanksgiving? However I had made a fatal mistake that I would not realize until much later.At dinner we indeed had pie, apple pie with a beautiful lattice crust and pumpkin pie. Unfortunately I’m a fan of sweet potato pie. It tastes delicious to me so I really missed having it for dessert. </p><p>When I said yes we never agreed to a specific kind of pie. This was a miscommunication on my end, I never said I was expecting sweet potato pie. I assumed that everyone loved sweet potato pie as much as I do. However they had just gone apple picking so there was an abundance of apples, so they made apple pie. Pumpkin pie is also very traditional so it is no surprise that it was made for dessert. There was no way she would know that I wanted sweet potato pie unless I told her. </p> <p>Looking back on that day I was initially disappointed however in the end I realized that family is more important than being spoiled. If I could go back in time to when I said yes to my sister I would elaborate more. Specifically I would ask her if she was making sweet potato pie since that is my favorite dessert. At that time if she said no I could have offered to pick one up since I was  in the store. She would have also benefited from this because she would have less pie to make.  More importantly no pumpkins would go to waste since no one actually wanted to eat the pumpkin pie. </p><p>Overall the lesson learned from this experience is to be direct and express yourself clearly. No one will know what brings you pleasure if you don't communicate that to them. In the future I will practice this by thoughtfully expressing myself to the ebay of my abilities. One word answers will never convey the deeper thoughts that we want people to know about us. </p>"
        }
    ]

}

