{
    "blogs": [{"id": 0,
        "title": "Writing",
        "url": "writing",
        "label": "writers journal 1",
        "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/British_Museum_Flood_Tablet.jpg/800px-British_Museum_Flood_Tablet.jpg",
        "date": "December 1, 2021",
    "content": "&nbsp;&nbsp;&nbsp;&nbsp; Throughout my years as a student I have written many papers so this is a cherished topic. Writing can take on different styles but in essence I like to think of it as the communication of ideas through text. Early on in my life I learned the basics of writing along with reading while in school. Even at that early age we practiced similar habits of mind including creativity, flexibility and metacognition. <br /> &nbsp;&nbsp;&nbsp;&nbsp; History teaches us that writing was developed as a way to track transactions. We often write journals or blogs about what is happening in our daily life. However that may not be what’s most admired by us, we are more likely to enjoy a good story. Such as the Epic of Gilgamesh, one of the first the earliest written texts. Fictional tales like this are amazing for developing the creativity of writers which is one of the reasons it is still known of today. When writing either factual accounts or completely fictional it is the communication of ideas that intrigues us the most.  <br /> &nbsp;&nbsp;&nbsp;&nbsp; The process of learning to write starts at a young age. As kids when we start school we are introduced to the alphabet so we can start reading and writing small words. While progressing through school we read and write much more. Some of my favorite authors to read are J.K.Rowling, James Patterson and Scott Galloway. Although these authors write about different topics or within different genres they have the ability to communicate ideas that are entertaining to the reader. This has taught me the importance of analogies and metaphors. These literary concepts keep readers engaged like they are watching a martial arts master practicing his craft. Just like any craft must continue practicing writing to learn how to connect with different audiences or as described in this course rhetorical knowledge.  <br /> &nbsp;&nbsp;&nbsp;&nbsp; My understanding of writing also includes the important habits of mind. Creativity within writing is very interesting. It allows the reader the opportunity to think about your ideas in a way that they have not heard before. Along with that flexibility allows us to write on a broad range of topics. This ranges from serious writing such as a sermon or biography to more creative and playful writing like romance novels and comic books. It will be important to be mindful of staying flexible as writers as we develop our rhetorical knowledge. As we develop our skills as writers metacognition becomes ever more important, the ability to think about what we have written in the past and improve upon those ideas for even greater clarity to the reader.  <br /> &nbsp;&nbsp;&nbsp;&nbsp; As expressed writing is a craft that you can practice but it will take a long time to master it. Even when you feel masterful there are more audiences to write for and styles of writing you can practice. My understanding of writing is that you can always continue to grow. Throughout this course we will continue to practice habits of mind so that we too can become better writers."
},
    {"id": 1,
    "title": "Writing Journal #2",
    "url": "wj2",
    "img": "https://images.pexels.com/photos/57690/pexels-photo-57690.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
    "date": "Feburary 10, 2022",
"content": "   <p>In this journal I will discuss my first impressions of the Literacy Narrative. Planning our first major writing assignment feels like a big undertaking. This could be due to the lack of writing I have been doing. I know that writing consistently is the key to success in a course like this. However, since I stopped blogging I haven't had the motivation to work on my writing skills. When I do find the time to write it is much more convenient to write about my hobbies and interests. Therefore Literacy Narrative will be a lot more strict than my own personal creative writing.</p> <p>My first impressions of the writing narratives are that you can write about anything you've written in the past. That's very vague and there's endless possibilities since I have written a lot. I'm concerned that the vagueness will add to the complexity when trying to stay on topic. With  such a high word length it will be difficult not to ramble on about pointless topics. There will also be the need to make sure all topics are organized and flow consistently. I'm excited to share my experience with creative writing. Whether it be essays, term papers, book reports, or simple blog posts. I have written all of these things and they have helped shape me as a writer. </p> <p>Critical thinking and composing are the most important communication literacies in my life at the moment. Although we do live in a social media world I find myself writing more for professional purposes more often than personal. Ironically this is mostly chatting with my team members on slack or developing my professional network on LinkedIn. Slack and other team communication software has gotten even more important since the covid pandemic has started. The team I work with is full of remote workers and we need to be able to communicate to get our work done. Due to the nature of this type of communication it can be harder to communicate successfully this is why critical thinking and composing are so important. We need to ensure that work gets done efficiently while being as concise as possible. </p> <p>It may have helped if we had some type of formal training on communication in these platforms but there is no standard. Unfortunately while working independently through covid a lot of us found ourselves picking up new skills and moving into new fields. This is great for personal growth especially since we have to learn so much on our own.  For me I was just told “we’re using Slack to communicate”, it was just expected of me to know how to use it. I’m assuming it was the same for the rest of the team. I wish there was more formal communication training so everyone knew about how to transfer files or even better using GIt. Files become a huge mess especially when multiple people are working on the same file that becomes over a thousand lines long!</p> <p>I’m looking forward to writing the narrative assignment. It will be a great opportunity to share my experience with communication literacies. Until then I will be using my reading skills with Race after technology by Ruha benjamin. </p>"
   },
    {"id": 2,
        "title": "test 2",
        "url": "test2",
        "img": "https://images.pexels.com/photos/7640773/pexels-photo-7640773.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
        "date": "October 31, 2021",
        "content": "lot of html2"},
        {"id": 3,
            "title": "test 3",
            "url": "test3",
            "img": "https://images.pexels.com/photos/8617636/pexels-photo-8617636.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500",
            "date": "October 31, 2021",
            "content": "lot of html3"}
    ]

}