{
  "blogs": [
    {
      "id": 0,
      "title": "Writing",
      "url": "writing",
      "label": "writers journal 1",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/British_Museum_Flood_Tablet.jpg/800px-British_Museum_Flood_Tablet.jpg",
      "date": "December 1, 2021",
      "content": "&nbsp;&nbsp;&nbsp;&nbsp; Throughout my years as a student I have written many papers so this is a cherished topic. Writing can take on different styles but in essence I like to think of it as the communication of ideas through text. Early on in my life I learned the basics of writing along with reading while in school. Even at that early age we practiced similar habits of mind including creativity, flexibility and metacognition. <br /> &nbsp;&nbsp;&nbsp;&nbsp; History teaches us that writing was developed as a way to track transactions. We often write journals or blogs about what is happening in our daily life. However that may not be what’s most admired by us, we are more likely to enjoy a good story. Such as the Epic of Gilgamesh, one of the first the earliest written texts. Fictional tales like this are amazing for developing the creativity of writers which is one of the reasons it is still known of today. When writing either factual accounts or completely fictional it is the communication of ideas that intrigues us the most.  <br /> &nbsp;&nbsp;&nbsp;&nbsp; The process of learning to write starts at a young age. As kids when we start school we are introduced to the alphabet so we can start reading and writing small words. While progressing through school we read and write much more. Some of my favorite authors to read are J.K.Rowling, James Patterson and Scott Galloway. Although these authors write about different topics or within different genres they have the ability to communicate ideas that are entertaining to the reader. This has taught me the importance of analogies and metaphors. These literary concepts keep readers engaged like they are watching a martial arts master practicing his craft. Just like any craft must continue practicing writing to learn how to connect with different audiences or as described in this course rhetorical knowledge.  <br /> &nbsp;&nbsp;&nbsp;&nbsp; My understanding of writing also includes the important habits of mind. Creativity within writing is very interesting. It allows the reader the opportunity to think about your ideas in a way that they have not heard before. Along with that flexibility allows us to write on a broad range of topics. This ranges from serious writing such as a sermon or biography to more creative and playful writing like romance novels and comic books. It will be important to be mindful of staying flexible as writers as we develop our rhetorical knowledge. As we develop our skills as writers metacognition becomes ever more important, the ability to think about what we have written in the past and improve upon those ideas for even greater clarity to the reader.  <br /> &nbsp;&nbsp;&nbsp;&nbsp; As expressed writing is a craft that you can practice but it will take a long time to master it. Even when you feel masterful there are more audiences to write for and styles of writing you can practice. My understanding of writing is that you can always continue to grow. Throughout this course we will continue to practice habits of mind so that we too can become better writers."
    },
    {
      "id": 1,
      "title": "Writing Journal #2",
      "url": "wj2",
      "img": "https://images.pexels.com/photos/57690/pexels-photo-57690.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
      "date": "Feburary 10, 2022",
      "content": "   <p>In this journal I will discuss my first impressions of the Literacy Narrative. Planning our first major writing assignment feels like a big undertaking. This could be due to the lack of writing I have been doing. I know that writing consistently is the key to success in a course like this. However, since I stopped blogging I haven't had the motivation to work on my writing skills. When I do find the time to write it is much more convenient to write about my hobbies and interests. Therefore Literacy Narrative will be a lot more strict than my own personal creative writing.</p> <p>My first impressions of the writing narratives are that you can write about anything you've written in the past. That's very vague and there's endless possibilities since I have written a lot. I'm concerned that the vagueness will add to the complexity when trying to stay on topic. With  such a high word length it will be difficult not to ramble on about pointless topics. There will also be the need to make sure all topics are organized and flow consistently. I'm excited to share my experience with creative writing. Whether it be essays, term papers, book reports, or simple blog posts. I have written all of these things and they have helped shape me as a writer. </p> <p>Critical thinking and composing are the most important communication literacies in my life at the moment. Although we do live in a social media world I find myself writing more for professional purposes more often than personal. Ironically this is mostly chatting with my team members on slack or developing my professional network on LinkedIn. Slack and other team communication software has gotten even more important since the covid pandemic has started. The team I work with is full of remote workers and we need to be able to communicate to get our work done. Due to the nature of this type of communication it can be harder to communicate successfully this is why critical thinking and composing are so important. We need to ensure that work gets done efficiently while being as concise as possible. </p> <p>It may have helped if we had some type of formal training on communication in these platforms but there is no standard. Unfortunately while working independently through covid a lot of us found ourselves picking up new skills and moving into new fields. This is great for personal growth especially since we have to learn so much on our own.  For me I was just told “we’re using Slack to communicate”, it was just expected of me to know how to use it. I’m assuming it was the same for the rest of the team. I wish there was more formal communication training so everyone knew about how to transfer files or even better using GIt. Files become a huge mess especially when multiple people are working on the same file that becomes over a thousand lines long!</p> <p>I’m looking forward to writing the narrative assignment. It will be a great opportunity to share my experience with communication literacies. Until then I will be using my reading skills with Race after technology by Ruha benjamin. </p>"
    },
    {
      "id": 2,
      "title": "Writing Journal #3",
      "url": "wj3",
      "img": "https://images.pexels.com/photos/1194197/pexels-photo-1194197.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260",
      "date": "Feburary 12, 2022",
      "content": "<p>Taking a walk down memory lane. In this journal we will look back at the past journals we have written. I am a firm believer that reflecting on the past can help you grow as a person. You may be able to identify errors in your own decision making that will help you make better decisions in the future. This applies perfectly to writing because we can look at our past work and improve upon what we have written so far. </p> <p>At this point in the course we have written two journals so far. My initial approach to the assignments has been to read over the requirements listed in the tasks section and write at least one detailed paragraph for each point. These assignments have shaped my writing by allowing me to practice the habits of mind. I feel a sense of enhanced metacognition now that I have been writing more. Now when I sit down to write I no longer feel the anxiousness over the word count or even the confusion that comes with trying to write the next sentence. There’s a more peaceful flow that helps me get the assignments done. </p> <p>Being able to process my thoughts in a much more organized way will help me not only in this course but in life as well. I believe the openness and responsibility gives me the desire to become a better human being overall. The best thing about these assignments in my opinion is that they have structure. Just as in life there is a criteria of what needs to be accomplished and it’s up to us to figure out the best way to tackle these problems. As a computer scientist this is a significant skill since the main requirement of the job is problem solving. In this field we mostly focus on math, however I believe writing is just as powerful. In math we are given a problem and expected to solve it by finding a specific answer. Writing similarly to life, is not like that. We have a lot more freedom to express ourselves creatively, no two lives are the same just as with writing assignments.</p> <p>A big concern of mine is interpersonal communication, I believe that being a great writer will also make you a better communicator. The way that writing makes us structure our words and thoughts is an absolute benefit to us. Structure gives us the ability to clearly explain our points in a way that the person we are communicating with will understand. For instance someone that lacks the structure we develop by writing may have great ideas but people will not be able to digest them if they leave people confused when they express themselves. When we structure our thoughts we have a better understanding of what our audience needs to understand before we move on to more complex ideas. </p>        <p>These writings have been a great experience. My mind is being developed so that i can not only solve more complex problems but explain these concepts to others and hopefully bring them to the same level of understanding. I see this as much more than just a course for credit but a life skill that will continue to pay dividends. </p>"
    },
    {
      "id": 3,
      "title": "Writing Journal #4",
      "url": "wj4",
      "img": "https://images.pexels.com/photos/4262007/pexels-photo-4262007.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500",
      "date": "Feburary 14, 2022",
      "content": "<p>Miscommunication can derail your plans, in this writing journal we will reflect on a situation where the wrong use of words caused unintended results. We will also explore how word choice can affect others. When we are communicating in this digital age we still have to be sure to be clear with what we are saying. Sending quick texts to family and friends is fun, however  we must still put effort into them to ensure we have communicated our thoughts clearly.</p><p>It’s thanksgiving day, in my family it’s tradition to eat at my mom’s house. My sister and I often communicate through text. This time we were talking about the dinner menu to make sure we all had our favorite food. I was picking up a few drinks at the store when she sent me a text saying, Do you want pie for dessert? Excitedly, I responded Yes! After all, who could resist pie on Thanksgiving? However I had made a fatal mistake that I would not realize until much later.At dinner we indeed had pie, apple pie with a beautiful lattice crust and pumpkin pie. Unfortunately I’m a fan of sweet potato pie. It tastes delicious to me so I really missed having it for dessert. </p><p>When I said yes we never agreed to a specific kind of pie. This was a miscommunication on my end, I never said I was expecting sweet potato pie. I assumed that everyone loved sweet potato pie as much as I do. However they had just gone apple picking so there was an abundance of apples, so they made apple pie. Pumpkin pie is also very traditional so it is no surprise that it was made for dessert. There was no way she would know that I wanted sweet potato pie unless I told her. </p> <p>Looking back on that day I was initially disappointed however in the end I realized that family is more important than being spoiled. If I could go back in time to when I said yes to my sister I would elaborate more. Specifically I would ask her if she was making sweet potato pie since that is my favorite dessert. At that time if she said no I could have offered to pick one up since I was  in the store. She would have also benefited from this because she would have less pie to make.  More importantly no pumpkins would go to waste since no one actually wanted to eat the pumpkin pie. </p><p>Overall the lesson learned from this experience is to be direct and express yourself clearly. No one will know what brings you pleasure if you don't communicate that to them. In the future I will practice this by thoughtfully expressing myself to the ebay of my abilities. One word answers will never convey the deeper thoughts that we want people to know about us. </p>"
    },
    {
      "id": 4,
      "title": "Writing Journal #5",
      "url": "wj5",
      "img": "https://images.pexels.com/photos/7579363/pexels-photo-7579363.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
      "date": "Feburary 14, 2022",
      "content": "<p>Today we will look at how my writing has grown throughout the course so far. This week we have introduced a new writing process, in this journal we will compare and contrast the old and new processes of writing. By doing this we will be able to reflect on our writing in order to grow into better writers. Essentially we are becoming better decision makers so that we can clearly convey our thoughts. </p> <p>Previously my approach to writing has been very structured. Using the same formula for my writings has given me consistent results. Initially I think of a concept for the writing journal then begin to put together a rough draft. In this draft I would get all of my thoughts out and include as much detail as possible. Afterwards I go through it and see if I missed any details. Checking to make sure all of my points are clearly addressed within the writing. Finally I make sure the writing flows well and there's no errors throughout the text. At this point the writing is complete and ready to be turned in. By following these steps I have been able to ensure that I produce good quality writing. </p>        <p>At first glance we can see that our new writing process has five components. This is even more detailed than my original process which I thought was very well structured. However upon looking deeper we can see that there are very similar concepts. When I write these five stages, invention, planning, drafting, revising and editing tend to blur more often than not. While I’m inventing I am also planning since it is hard to invent a piece of writing without carefully planning when to introduce each idea. However after that the process is pretty much the same as the process I have been using. </p> <p>Looking deeply into how I have been writing in the past I can see that my process was rushed. I can spend a lot more time earlier in the process so that the final product comes out even better. When I’m brainstorming there’s no need to immediately start drafting. Instead I can use this time to pull out more ideas so the writing can have more detail to paint a better picture for the audience which is a part of the planning stage. This makes me think of the Mark Twain quote, “Writing is easy. All you have to do is cross out the wrong words.” </p> <p>Now that we have analyzed our writing and compared it to the new writing process we can develop better writing skills. My brainstorming process will be more effective leading to a substantially better quality of writing to start the planning process with. In return the audience will get to enjoy an entirely different experience when reading my writing journals.</p>"
    },
    {
      "id": 5,
      "title": "Writing Journal #6",
      "url": "wj6",
      "img": "https://images.pexels.com/photos/11164448/pexels-photo-11164448.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
      "date": "Feburary 17, 2022",
      "content": "<p>In this journal we are supposed to reflect on how the new writing process makes us anxious or nervous. However I’m of the mind that structure is better than chaos so I’m very excited to use the new writing process to the best of my ability. Instead of looking at all of the ways the writing process could give us anxiety I will highlight the ways this process will actually relieve anxiety, for me at least. I believe that my peers will have similar revelations once they get over the burden of more work.</p> <p>My major problem with the new writing process would absolutely be that it is much more time intensive. Previously when writing I could blend a lot of these steps into one fluid process. However this new writing process is much more rigid in structure.Breaking down the writing process into a more detailed form will force us to gather even more details, examples and explanations when we are writing our papers. I’m concerned that this search for more evidence to support our points will lead to unnecessary clutter within our writings. After all, when a point is made how much more should you continue to reinforce what you are proving? </p> <p>Although I despise the additional workload I do believe it will yield a better final revision of our writing. I’m very excited to try writing like this because I have always felt there is something missing from my writing. Hopefully breaking my process down even more will help me identify where I could spend more time perfecting my craft. Being introduced to this writing process is a tremendous opportunity for us since we will be able to grow as writers with the new found structure around our writing.</p> <p>I could see myself not using this detailed process in some cases where the overall writing is shorter, for instance Twitter. Even though they increased the character limit I do not think this process would shine there. This process is better at long form writing such as the Literary Narrative we have coming up shortly. I will definitely use this process on that project since it has such a high word  count. The new structure will make it much easier for me to reach that word count without feeling as if I’m grasping for straws when trying to reach the word count. </p>  <p>Overall I will feel a great sense of relief now that we have this writing process. Instead of viewing the process as a burden I see it more  as a helpful companion. Sure this process will require me to put much more hours into my writing but it is for my own benefit. So I am grateful for that. How else would we be able to achieve masterful writings in a short period of time? It comes down to structure. This new writing process will help me produce my best work yet!</p>"
    },
    {
      "id": 6,
      "title": "Writing Journal #7",
      "url": "wj7",
      "img": "https://images.pexels.com/photos/4237492/pexels-photo-4237492.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
      "date": "Feburary 22, 2022",
      "content": "<p>In this jornal we will reflect on the looping activity we did in the previous participation exercise. Overall it was a great exercise in metacognition for me. I have never been so introspective as I was when practicing looping. I believe in the future this will help me be more creative by elaborating on ideas and making them into detailed explanations of my thoughts. ANother habit of mind that comes to mind when I think about looping is openness, there’s a degree of vulnerability when you dive deeper into your own thoughts. You start to realize why you have certain beliefs and can challenge yourself to resolve the errors in your own logic. </p><p>As stated previously, I loved doing the looping activity. For my literacy narrative I decided to write about my first  time writing a sales script. I still do not have this idea planned out to the point it would reach 1000 words, however the looping activity has helped me get much closer to that goal. During the looping event we were tasked with analyzing our chosen topic and thinking deeper about it. Pulling it apart,  dissecting it until we reach a deeper topic that we could expand upon even more. </p> <p>For me the primary insight that came from the looping activity was discipline. After reflecting on the experience that was writing my first sales script I came to the realization that it all came down to being disciplined. I would have never been able to complete the task if I didn't work at it diligently. Just lie any other accomplishment that is worthwhile, consistent focus and effort makes all the difference. Writing that sales script didn't just make me a better writer but it helped improve my character as a person. I was able to put my mind to something that I at first thought would be extremely difficult and accomplish it because I found the disciple to work at it. </p> <p>As an interventional tool the looping activity is amazingly insightful because you get to take an idea and then go deeper. This gives us the ability to add more details and experiences that support the point we are trying to make. The only way I could see this tool being unhelpful is if the original idea is weak to begin with. IF there’s no substance to the original idea it may be hard to look deeper into it because it's not factual. In my opinion this is actually helpful because it forces you to weed out bad ideas.</p> <p>So to conclude this writing I would say that the looping activity overall is a positive tool that all writers should use. I am very excited to use this in the literary narrative since it will not only help me reach the word count but it will also help me clarify the ideas that I have. When looping I will be able to see where these thoughts or ideas come from and be able to relate them to my audience. </p>"
    },
    {
      "id": 7,
      "title": "Writing Journal #8",
      "url": "wj8",
      "img": "https://images.pexels.com/photos/3769162/pexels-photo-3769162.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
      "date": "Feburary 23, 2022",
      "content": "<p>In this journal we will create the initial plan to complete the literacy narrative. We are doing this in hopes that it will make the actual assignment easier to write and give us a finely polished  essay. The literacy narrative is a highly complex piece of writing so planning will give us the extra material to work with by practicing our habits of mind creativity, persistence, flexibility and metacognition. I’m very interested to see the growth of my writing by utilizing planning. Producing a thorough rough draft will be a great first step in achieving this goal. </p>              <p>The primary insight of my literacy narrative is be discipline. In order to lead my audience to this primary insight I desire to discuss my first time writing a sales script. This writing will show that with discipline all things are possible. In the beginning I started off inexperienced since I have never written anything like that before. Through consistent effort I was able to break down this task step by step and build a successful script for myself. None of this would have been possible without discipline since there were many days where I felt I could not complete the assignment. </p> <p>The literacy narrative should also include subsections that show what discipline is and how I used the skills to complete the sales script. Structuring this properly will be of the utmost importance so that the reader is able to understand how much discipline played a role in completing the assignment. First I want to lay out the objectives for the sales script and why it was so important. I will expand on how much this script meant to me not only as a part of my job there but also the greater role this skill has in life. Then we will discuss how I actually broke this problem down in order to achieve it. There was so much research put into the assignment that you may not realize since the final script was so short. I will also include books and videos read prior to writing the sales script. I believe this made a big difference in the final outcome since the research helped produce great results. Lastly I plan on discussing the results that my disciple earned me. In my first month I was able to produce better results than my peers. This was due to solely my preparation and planning while producing the sales script. </p> <p>In conclusion the literacy narrative should be much easier now that we have these systems in place. Along with looping this effort in planning is going to make the writing process  more fluid. I’m sure that the readers will appreciate the amount of detail and effort put into the writing.</p>"
    },
    {
      "id": 8,
      "title": "Writing Assignment #1",
      "url": "wa1",
      "img": "https://images.pexels.com/photos/7578962/pexels-photo-7578962.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
      "date": "March 7, 2022",
      "content": "<img class='lead' src='https://images.pexels.com/photos/6802047/pexels-photo-6802047.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500'/> <p>In this assignment I will discuss an important event in my journey as a writer. Through discipline I believe all things are possible. In this assignment I will attempt to prove that to you, the reader, by informing you on what discipline did for me during a time where I felt very uncertain of my writing. </p>      <p>A few years back during the spring I was accepted by a major communication company to be one of their direct sales representatives. Prior to this I had sales experience from being in a call center. In the call center we placed calls to businesses using a script that was provided for us. At the communication company it was completely different. Not only did they not provide a script for us, they didn’t even give us feedback once we each wrote our individual script. For me this was a big deal because I am always very critical of my own work. Now I have to produce my own high quality script in addition to that I had to go out and attempt to persuade people using it. Meaning that if my script was bad I wouldn’t make anywhere near the amount I was making at the call center. </p> <p>How could I accomplish this lofty goal? I had never written a script before in my life. At this point in my life the most important thing I had ever written would be my SAT essay. Of course the SAT essay was very important at the time, however once it’s done you can go on to the school of your choice and continue to improve yourself as a writer. The stakes were much different now, a bad script wouldn’t allow me the opportunity to improve even worse it would ultimately leave me unemployed. After the training sessions we would be sent into the field to produce sales using our newly crafted scripts. The goal for our first month was 8 sales, which seemed doable for me. Coming from the call center where the sales were much harder to finalize I was already capable of closing more than 2 deals per week. This told me that if I could make a decent script it would easy money in the bank. </p><img src='https://media2.giphy.com/media/sQBkCTTrJRLSE/200w.gif?cid=82a1493bsatsgla0w50m5y9vpiwnypeu9uyhmtq1gkxv25in&rid=200w.gif&ct=g' class='wa1-gif'/> <p>My task was clear,  I must make the best script I possibly could. So I started out with what I knew, The Straight Line pitch. As tragic as the movie wolf of wall street was I still consider Jordan Belfort a decent salesman. His technique does work however I believe most popular techniques work, not because the creator is amazing but because it gives you a structure to follow. Similar to a recipe to produce delicious food, following a sales formula will also help you produce amazing results. This is due to the fact that once you have a system you can repeat that system and tweak it to your taste or desired results.</p> <p>Although I had a system in place to help me it took discipline to be able to tailor the script to my specific situation. I wasn’t selling financial services any more which is what Jordan also sold. This time I was selling telecommunication services, this type of  service comes with a different set of expectations, objections, and responsibilities. With this in mind writing the script seemed daunting at first but I was able to work my way through it. Similar to this assignment I went through a rigorous process of writing, talking to myself to see if it was effective, deleting worlds that weren't necessary and then writing some more. This process overall may have taken me a full work week, unfortunately it was done off the clock on our personal time. Every day for two weeks I would go to training during the day and then work on my script afterwards. </p><iframe type='text/html' sandbox='allow-scripts allow-same-origin allow-popups' width='336' height='550' frameborder='0' allowfullscreen style='max-width:100%; display:block; margin:auto' src='https://read.amazon.com/kp/card?asin=B01MG7ETBM&preview=inline&linkCode=kpe&ref_=cm_sw_r_kb_dp_WDFCWFWR7A89VZNWDSYQ'  ></iframe> <p>While writing I had to remember that I was not writing this script for myself. This was for an audience, specifically homeowners many of whom already had these services from our competitor. In order to write a script for this audience I had to put myself in their shoes. What do they want from their service? How might their current provider be disappointing them? Most importantly  of all, why should they go through the hassle of switching providers? By the end of it I was amazed with my personal growth because I was finally putting the needs of others before my own. This process made me slightly less self-serving and genuinely invested in being able to connect with our potential customers. </p> <p>Once the script was finished it was time for trial by fire. We presented our scripts once to our fellow co-workers, it was at this point that we started losing people. Some weren’t able to complete their scripts and decided to completely move on from the company. Although I thought my script was mediocre I was determined to see what I could produce in the field. That month I finished with 16 sales! Twice as many as required by the company and more than most of my classmates. This was an amazing experience that made me much more confident in my writing abilities. Through discipline and dedication to producing quality work I was able to craft my own script to produce results that exceeded expectations. </p> <p>All things considered, writing the script turned out to be easier than I had initially thought. It took a lot of hours of consistent effort but in the end I had produced a high quality piece of work that would continue to pay itself back over time. To me this is another example of , “do the hard work even when you don't feel like it” . You may not feel up to the challenge but with consistent effort you can do anything you put your mind to.</p>"
    },
    {
      "id": 9,
      "title": "Writing Journal #9",
      "url": "wj9",
      "img": "https://images.pexels.com/photos/3727461/pexels-photo-3727461.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
      "date": "March 9, 2022",
      "content": "<p>In this journal we will discuss our plan to revise the original draft of our writing assignment. I will detail the steps that will be taken to complete the project. The end result for the assignment should be one of my best writing pieces yet due to the amount of effort and planning put into it. Creating this plan for the revision will ensure that the final work is just as amazing as we intend it to be. We will also consider deadlines and time constraints throughout the week.</p>      <p>The peer review and reflection was a new experience for me. I had never written a piece of writing and had it reviewed by my peers before. The only thing similar would be receiving critiques in photography class. I appreciate the insight of my peers although they did not give me much to go on. I believe this happened because I did a very thorough job when making my first draft. My vision for the piece was clear and I was able to plan it accordingly. Due to this my peers were not able to give me much feedback. However the work is not complete I will attempt to improve the way I convey how significant this was in my journey as a writer. </p> <p>Since the original draft was very well thought out I will be able to make my revisions without spending too much time on them. This makes me very happy because it shows that my hard work has paid off. In order to show that this event was significant in my life I will need to revise sections to convey more emotion. It will take some time for me to dig deeper into myself to find the words that will help my audience understand that this was a very pivotal moment in my writing journey.</p> <p>In order to revise my writing assignment I will take the following steps. First I will reread the writing to see where my writing could be improved with more detail. It is important that my audience understand that this was the most important event in my writing journey so far. Secondly once I find these points I will attempt to convey more emotion within them. Although it is important for me to convey the significance of the script I may struggle to actually find the words that will help me accomplish this task. </p> <p>In conclusion now that we have a revision plan the work needed to be done is much clearer. I am thankful for this moment of clarity because it will not only help me produce a better final project, it will also help me become a better writer overall. Utilizing the habits of mind taught in this course such as persistence I will be able to overcome any obstacles that may be ahead of me.</p>"
    },
    {
      "id": 10,
      "title": "Writing Journal #10",
      "url": "wj10",
      "img": "https://images.pexels.com/photos/2833648/pexels-photo-2833648.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
      "date": "March 14, 2022",
      "content": "<p>In this writers journal we will differentiate space from place. This can illuminate some ideas of how things change around us. This journal will detail spatial characteristics of space, a space’s place and how the place constructs its users. These are important details as we move forward in the course as well as life in general. Keeping these factors in mind we will be able to determine who a space has been designed for along with who will be excluded by these choices. </p> <p>Space is usually referred to in terms of outer space. For now we will focus on a space closer to us. My neighbor had a nice yard just across the street from me. In the warmer months he would have fruits, vegetables and visitors would come for barbeques. The smell of his spices were foreign to me as he was from Guyana and brought his culture with him to be shared with the neighborhood. It was a very nice space, well it still is because physically the space has not changed. It is still the same fifteen foot by twenty foot lot that it has always been.</p> <p>However this place has changed drastically. No longer is it the peaceful loving home of a family. My neighbor moved away and the new owners have turned his yard into a parking lot. The space is small so luckily there isn’t that much parking but still this has changed the functionality of the space making it feel like a different place. The purpose of this place has undergone a transformation under new ownership. Since they deem it a rental property I guess it makes sense that the small yard could be used to bring in more income.</p> <p>Nevertheless I think this is a terrible idea. This space should not be used in that way. The major transportation spots have parking lots closer to them. This would be an inconvenience for the people that live on the street since this will bring additional commercial traffic. Not only will there be a bigger burden on the main road but the residents of the home will not be able to use the outdoor space recreationally. The parking lot will have to function most days of the year leaving little time for the fun activities we had before. Since this is a single family home there should be more regulations about what kinds of businesses can operate in this area.</p> <p>To sum this all up there difference between space and place should now be apparent. Space is the physical dimensions of the area being described. While the term place is more related to the functions done in the area. Two places can occupy the same amount of physical space but be very different in use. Unfortunately I found that my old neighbors yard would be the perfect way to show in detail the difference between space and place. Now that we have this understanding we will be able to see these complexities throughout our daily life. </p>"
    },
    {
      "id": 11,
      "title": "Writing Journal #11",
      "url": "wj11",
      "img": "https://images.pexels.com/photos/607812/pexels-photo-607812.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "date": "May 27, 2022",
      "content": "<p>In this journal we will discuss an element of a social media site. Specifically we will take a look at the main feed for linkedin. While examining this element we will take a deep dive into how exactly this feed works. Additionally we will find out how our communication is shaped by their service. This thought exercise will help us realize some of the possibilities of using this social media application to help communicate with others. </p> <p>Let’s start with what exactly is linkedin anyway? Linkedin is a specialty type of social networking site. Unlike Facebook or Instagram the purpose of Linkedin isn’t to just socialize with old friends or family. Linkedin is more used for professional networking and career development. On Linkedin you can do things to advance your career like connect with recruiters or even post your resume to be seen by potential employers.  By adding relevant information about your professional background linkedin then decides which recruiters or employers would be most interested in further communication with you. </p> <p>After the initial setting up of your profile it is now time to start posting content. You do this by interacting with the post element. Unlike twitter, linkedin gives you much more characters to express yourself. Instead of limiting you to only 280 characters, linkedin gives you a whopping 3,000 characters to impress recruiters and potential employers. This fact shows you that linkedin is more interested in allowing you to clearly communicate with your audience because they allow you to write more within a single post. Another notable feature of linkedin is that when you post you have the option of enriching your posts with multimedia. You can add things such as photos, documents, polls, events, videos and even the feature to create a celebration for receiving a desired employment opportunity. </p> <p>Capitalizing on these features gives us a huge advantage when it comes to our own personal branding as well as job seeking. Since we are allowed to share so much, potential employers can get a better idea of who we are and what we can bring to their organization. While posting is usually done on your main profile page it can also be done within groups. In these groups you can connect with other people who have similar interests to you. For instance I’m a part of a WordPress development group. In that group I can post things like what I’m currently working on or I can help others with issues they may be having. This is a great tool because it gives me the opportunity to share my expertise with other people who may not be in my immediate network. </p> <p>As you can see the posting element on linkedin is a very powerful tool. Utilizing this feature we can communicate with people all across the world. What an amazing opportunity for all of us, employers and potential employees can now get much more detailed information about each other before the first interview. I believe this will greatly benefit us in our future careers.</p>"
    },
    {
      "id": 12,
      "title": "Writing Journal #12",
      "url": "wj12",
      "img": "https://images.pexels.com/photos/6957747/pexels-photo-6957747.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "date": "May 31, 2022",
      "content": "<p>Today we are here to evaluate the outcome of our Talk-to process. We used this tool in order to take a step back from our second writing project, this way we can get a different perspective on what we have written so far as well as what more needs to be written. The talk-to process is great for situations where you can not have someone else review your writing before publishing because it allows you to gain additional insight. This new insight can then help create a more thorough writing piece that the audience can appreciate.</p> <p>The first requirement of the talk-to process is to, “imagine that your context analysis is the best thing you have ever read, and describe why this is the case”. To me this was a very powerful thought process. It urged me to highlight everything that was good about my writing. It showed places where I had put a lot of effort into the writing piece. These are areas where I think the audience will be able to connect with the writing, maybe even find it intriguing. This step in the process also shows me that effort was put into crafting the writing project in a way that fulfills all requirements. Secondly we were required to, “imagine that your context analysis is really quite terrible and describe why”. This step was even more thought provoking than the first. Instead of trying to find everything that was good in the project I had to deliberately look for everything that was wrong or flawed. When looking at a project with such a critical eye a lot of things can become very apparent that at first glance seem to be fine. </p> <p>Now that we have created this critical distance we can see changes that should be made to the writing project. The overall structure of the project is great however it could be improved. These improvements will be made by adding more examples to the writing project so that the audience can have a clearer understanding of the context. In order to add more detail to the project we will go back and look for historical information that further highlights the way our communication is shaped on the platform. This will allow the audience to have a better understanding of how these small, seemingly insignificant interfaces can have a big impact on the context of our communication.</p> <p>Overall I am very pleased with the outcome of this talk-to session. It has highlighted a great amount of information that is important to the audience. In order for the context to be made clear to the audience we must include these additional details. This will paint a clearer picture for the audience meaning the overall message of the writing project is able to be understood.</p>"
    }
  ]
}
